blog/2017/03/03/使用emacslisp实现rsa签名/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>使用emacslisp实现RSA签名 - EMACS-DOCUMENT</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"/>
  <meta name="author" content="lujun9972" />
  <meta name="keywords" content="elisp-common" />
  <!-- <link rel="stylesheet" href="../../../../../media/css/main.css" type="text/css"/>
       <link rel="stylesheet" href="../../../../../media/css/comment.css" type="text/css"/> -->
  <link rel='stylesheet' href='https://cdn.jsdelivr.net/gh/kognise/water.css@latest/dist/dark.css'>
  <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css">
</head>

  <body><div class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="../../../../../">EMACS-DOCUMENT</a></h1>
    <p>=============&gt;集思广益</p>
    <nav class="site-nav">
      <ul class="trigger">
        <li><a href="../../../../../years/">Years</a></li>
        <li><a href="../../../../../authors/">Authors</a></li>
        <li><a href="../../../../../tags/">Tags</a></li>
        <li><a href="../../../../../about/">About</a></li>
        <li><a href="https://github.com/lujun9972/emacs-document">Github</a></li>
        <li><a href="../../../../../rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="https://www.bing.com/search">
      <input type="text" class="field" name="q" id="s" placeholder="Search">
      <input type="hidden" name="as_sitesearch" value="lujun9972.github.io/emacs-document">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">使用emacslisp实现RSA签名</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc2277a0">Evaluation with calc</a></li>
<li><a href="#org26d1d26">Generating primes</a></li>
<li><a href="#orga28f21c">Computing e and d</a></li>
<li><a href="#orgd2e50cb">Signatures</a></li>
<li><a href="#org62d7a34">Putting it all together</a></li>
</ul>
</div>
</div>
<p>
Emacs自带一个很牛逼的,能实现任意精度计算的代数系统，名叫 <a href="http://www.gnu.org/software/emacs/manual/html_mono/calc.html">calc</a>. 我 <a href="http://nullprogram.com/blog/2009/06/23/">之前有介绍过它</a>, 现在它已经成为我日常使用的工具之一了. 
是的,兄弟,Emacs可以作代数运算. 而且它和Emacs中的其他玩意一样,是可编程的,可以通过EmacsLisp对其进行扩展.
本文我就要告诉你怎么在EmacsLisp中用calc来实现 <a href="https://en.wikipedia.org/wiki/RSA_(cryptosystem)">RSA公钥密码体系</a> 
</p>

<p>
下面是完成的成果:
</p>

<ul class="org-ul">
<li><a href="https://github.com/skeeto/emacs-rsa">https://github.com/skeeto/emacs-rsa</a></li>
</ul>

<p>
当然这只是实现来玩玩的,不是真的想把它应用起来. 而且它的速度实在是太慢了.
</p>

<div id="outline-container-orgc2277a0" class="outline-2">
<h2 id="orgc2277a0">Evaluation with calc</h2>
<div class="outline-text-2" id="text-orgc2277a0">
<p>
由于Emacs的整数型是有长度限制的,因此 <code>calc</code> package就特别的有用.
Emacs并不会先分配一个整形对象然后用一个指针指向它,而是直接在指针中存放整数. 这样做的好处是,它的访问速度更快,但是意味着,Emacs中的整型能表示的范围要更小一些.
</p>

<p>
<code>calc</code> 定义了大量的API, 其中有一个特别好用的函数叫 <code>calc-eval</code>. 它可以接受一个字符串形式的运算式并计算出结果,甚至运算式还能用 <code>$n</code> 来进行参数替换.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>calc-eval <span style="color: #2d9574;">"2^16 - 1"</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; "65535"</span>

<span style="color: #4f97d7;">(</span>calc-eval <span style="color: #2d9574;">"2^$1 - 1"</span> nil <span style="color: #a45bad;">128</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; "340282366920938463463374607431768211455"</span>
</pre>
</div>

<p>
请注意,该函数返回的结果是字符串, 这是 <code>calc</code> 用来表示任意精度数字的一种方式. 而对于传递给它的参数,则既可以是普通的Elisp数字也可以是字符串.
默认情况下, <code>calc</code> 认为这些数字都是十进制的. 不过你也可以修改它的基,方法是在数字前加上基数和#. 就跟交互式使用 <code>calc</code> 时一样.
举个例子:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>calc-eval <span style="color: #2d9574;">"16#deadbeef"</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; "3735928559"</span>
</pre>
</div>

<p>
<code>calc-eval</code> 的第二个参数是可选的,用来修改 <code>calc-eval</code> 的计算方式. 若为nil,则表示计算运算式并返回结果. 至于其他的值是什么意思,可以去查看manual文档.
不过在本文中,唯一用到的非nil值只有符号 <code>pred</code>,它表示让 <code>calc-eval</code> 返回时返回一个布尔值.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>calc-eval <span style="color: #2d9574;">"$1 &lt; $2"</span> 'pred <span style="color: #2d9574;">"4000"</span> <span style="color: #2d9574;">"5000"</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; t</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org26d1d26" class="outline-2">
<h2 id="org26d1d26">Generating primes</h2>
<div class="outline-text-2" id="text-org26d1d26">
<p>
RSA是建立在大数分解的复杂度基础上的. 要产生RSA键值对先需要产生两个质数 <code>p</code> 和 <code>q</code>,然后用这两个质数进行运算得到两个数学上相关的合成数(composite numbers).
</p>

<p>
<code>calc</code> 提供一个 <code>calc-next-prime</code> 函数来获取大于某个数的下一个质数. 该函数使用probabilistic primarily test — the Fermat Miller-Rabin primality test — 来实现对大数据的高效测试.
It increments the input until it finds a result that passes enough iterations of the primality test.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>calc-eval <span style="color: #2d9574;">"nextprime($1)"</span> nil <span style="color: #2d9574;">"100000000000000000"</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; "100000000000000003"</span>
</pre>
</div>

<p>
那么要产生一个随机的n位的质数,只需要先产生一个n位的随机数,然后找出大于它的下一个质数就行了.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Generate a 128-bit prime, 10 iterations (0.000084% error rate)</span>
<span style="color: #4f97d7;">(</span>calc-eval <span style="color: #2d9574;">"nextprime(random(2^$1), 10)"</span> nil <span style="color: #a45bad;">128</span><span style="color: #4f97d7;">)</span>
<span style="color: #2d9574;">"111618319598394878409654851283959105123"</span>
</pre>
</div>

<p>
不过 <code>calc</code> 的随机函数是基于Emacs的随机函数来实现的, 而Emacs随机函数的强度不足以被用于加密. 所以在实际实现时,我从 <code>/dev/urandom</code> 来读取n个比特作为n位的随机数.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">with-temp-buffer</span>
  <span style="color: #bc6ec5;">(</span>set-buffer-multibyte nil<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>call-process <span style="color: #2d9574;">"head"</span> <span style="color: #2d9574;">"/dev/urandom"</span> t nil <span style="color: #2d9574;">"-c"</span> <span style="color: #2d9574;">(</span>format <span style="color: #2d9574;">"%d"</span> <span style="color: #67b11d;">(</span>/ bits <span style="color: #a45bad;">8</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>f <span style="color: #b1951d;">(</span>apply-partially #'format <span style="color: #2d9574;">"%02x"</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span>concat <span style="color: #2d9574;">"16#"</span> <span style="color: #67b11d;">(</span>mapconcat f <span style="color: #b1951d;">(</span>buffer-string<span style="color: #b1951d;">)</span> <span style="color: #2d9574;">""</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
(请注意: 一定要使用 <code>/dev/urandom</code>. 原因请参见 <a href="http://www.2uo.de/myths-about-urandom/">no reason to use /dev/random for generating keys</a>)
</p>
</div>
</div>

<div id="outline-container-orga28f21c" class="outline-2">
<h2 id="orga28f21c">Computing e and d</h2>
<div class="outline-text-2" id="text-orga28f21c">
<p>
接下来就是按照 <code>Wikipedia</code> 来写代码了. 产生了质数 <code>p</code> 和 <code>q</code> 后, 使用公式 <code>n = p * q</code> 和 <code>i = (p - 1) * (q - 1)</code> 计算出两个相关数.
另外,我随意地选择 <code>65,537</code> 来作为指数e.
</p>

<p>
至于 <code>rsa--inverse</code> 不过是把Extended Euclidean算法按照 <a href="https://en.wikipedia.org/wiki/Extended_Euclidean_algorithm">Wiki上的伪代码</a> 用 Emacs Lisp + calc 来实现罢了. 
它本身没有什么好说的,如果你好奇怎么实现的话,直接看仓库中的代码吧.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">rsa-generate-keypair</span> <span style="color: #bc6ec5;">(</span>bits<span style="color: #bc6ec5;">)</span>
  <span style="color: #2aa1ae;">"Generate a fresh RSA keypair plist of BITS length."</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">let*</span> <span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>p <span style="color: #b1951d;">(</span>rsa-generate-prime <span style="color: #4f97d7;">(</span>+ <span style="color: #a45bad;">1</span> <span style="color: #bc6ec5;">(</span>/ bits <span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
         <span style="color: #67b11d;">(</span>q <span style="color: #b1951d;">(</span>rsa-generate-prime <span style="color: #4f97d7;">(</span>+ <span style="color: #a45bad;">1</span> <span style="color: #bc6ec5;">(</span>/ bits <span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
         <span style="color: #67b11d;">(</span>n <span style="color: #b1951d;">(</span>calc-eval <span style="color: #2d9574;">"$1 * $2"</span> nil p q<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
         <span style="color: #67b11d;">(</span>i <span style="color: #b1951d;">(</span>calc-eval <span style="color: #2d9574;">"($1 - 1) * ($2 - 1)"</span> nil p q<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
         <span style="color: #67b11d;">(</span>e <span style="color: #b1951d;">(</span>calc-eval <span style="color: #2d9574;">"2^16+1"</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
         <span style="color: #67b11d;">(</span>d <span style="color: #b1951d;">(</span>rsa--inverse e i<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    `<span style="color: #2d9574;">(</span><span style="color: #4f97d7;">:public</span>  <span style="color: #67b11d;">(</span><span style="color: #4f97d7;">:n</span> ,n <span style="color: #4f97d7;">:e</span> ,e<span style="color: #67b11d;">)</span> <span style="color: #4f97d7;">:private</span> <span style="color: #67b11d;">(</span><span style="color: #4f97d7;">:n</span> ,n <span style="color: #4f97d7;">:d</span> ,d<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
这里n和e就是公钥,n和d就是私钥. 下面我们就要开始计算并验证签名了.
</p>
</div>
</div>
