elisp-common/使用emacslisp实现RSA签名.org
* Signatures

计算整数m(m<n)的签名算式是 ~s ≡ m^d (mod n)~.
为了偷懒,我直接 [[https://en.wikipedia.org/wiki/Modular_exponentiation#Right-to-left_binary_method][将Wikipedia上right-to-left binary method的伪代码转换成Elisp实现]].
由于实现方法很简短,我这里把它也列出来了. 注意,震撼力的反斜杠表示整型除法.

#+BEGIN_SRC emacs-lisp
  (defun rsa--mod-pow (base exponent modulus)
    (let ((result 1))
      (setf base (calc-eval "$1 % $2" nil base modulus))
      (while (calc-eval "$1 > 0" 'pred exponent)
        (when (calc-eval "$1 % 2 == 1" 'pred exponent)
          (setf result (calc-eval "($1 * $2) % $3" nil result base modulus)))
        (setf exponent (calc-eval "$1 \\ 2" nil exponent)
              base (calc-eval "($1 * $1) % $2" nil base modulus)))
      result))
#+END_SRC

校验签名的过程跟上面是一样的,只不过使用公钥e参与运算: ~m ≡ s^e (mod n)~. 
如果签名是正确的,那么m会被正确地还原. 
理论上讲,只有在直到 =d= 的情况下才能从 =m= 计算出 =s= 来.
不过,如果 =n= 的值 [[http://crypto.stackexchange.com/a/5942][太小了]], 很容易就能分解出 =p= 和 =q= 来,那么 =d= 也就很容易从公钥中推算出来. 
所以,一定要注意你选择的 =p= 和 =q= 有足够的强度.

现在还剩下一个问题: 一般用户都是对字符串或者文件这类东西作签名的,不太可能对一个整数去做签名.
所幸,通过hash函数可以将任意长度的数据转换成一段适合签名的整数. 
Emacs本身就自带了很多hash算法,可以通过 =secure-hash= 函数来调用. 它可以对字符串和buffer进行hash运算.

#+BEGIN_SRC emacs-lisp
  (secure-hash 'sha224 "Hello, world!")
  ;; => "8552d8b7a7dc5476cb9e25dee69a8091290764b7f2a64fe6e78e9568"
#+END_SRC

由于结果是一个十六进制数,所以只要在签名加上 =16#= 就能直接当成calc中的整型来用了.

下面是实现的签名和验签函数,可以用来对字符串或buffer进行签名.

#+BEGIN_SRC emacs-lisp
  (defun rsa-sign (private-key object)
    (let ((n (plist-get private-key :n))
          (d (plist-get private-key :d))
          (hash (concat "16#" (secure-hash 'sha384 object))))
      ;; truncate hash such that hash < n
      (while (calc-eval "$1 > $2" 'pred hash n)
        (setf hash (calc-eval "$1 \\ 2" nil hash)))
      (rsa--mod-pow hash d n)))

  (defun rsa-verify (public-key object sig)
    (let ((n (plist-get public-key :n))
          (e (plist-get public-key :e))
          (hash (concat "16#" (secure-hash 'sha384 object))))
      ;; truncate hash such that hash < n
      (while (calc-eval "$1 > $2" 'pred hash n)
        (setf hash (calc-eval "$1 \\ 2" nil hash)))
      (let* ((result (rsa--mod-pow sig e n)))
        (calc-eval "$1 == $2" 'pred result hash))))
#+END_SRC

注意到这里面包含了一个对hash结果进行阶段的步骤. 这一步实际上会让你的 =n= 变得很容易被分解!
我这里之所以有这么一个步骤是因为本来这也就是写来玩玩的,而且我也不希望太大的key造成运算速度太过缓慢.

