blog/2017/03/03/使用emacslisp实现rsa签名/index.html

<div id="outline-container-orgd2e50cb" class="outline-2">
<h2 id="orgd2e50cb">Signatures</h2>
<div class="outline-text-2" id="text-orgd2e50cb">
<p>
计算整数m(m&lt;n)的签名算式是 <code>s ≡ m^d (mod n)</code>.
为了偷懒,我直接 <a href="https://en.wikipedia.org/wiki/Modular_exponentiation#Right-to-left_binary_method">将Wikipedia上right-to-left binary method的伪代码转换成Elisp实现</a>.
由于实现方法很简短,我这里把它也列出来了. 注意,震撼力的反斜杠表示整型除法.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">rsa--mod-pow</span> <span style="color: #bc6ec5;">(</span>base exponent modulus<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>result <span style="color: #a45bad;">1</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">setf</span> base <span style="color: #67b11d;">(</span>calc-eval <span style="color: #2d9574;">"$1 % $2"</span> nil base modulus<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #67b11d;">(</span>calc-eval <span style="color: #2d9574;">"$1 &gt; 0"</span> 'pred exponent<span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">when</span> <span style="color: #b1951d;">(</span>calc-eval <span style="color: #2d9574;">"$1 % 2 == 1"</span> 'pred exponent<span style="color: #b1951d;">)</span>
        <span style="color: #b1951d;">(</span><span style="color: #4f97d7; font-weight: bold;">setf</span> result <span style="color: #4f97d7;">(</span>calc-eval <span style="color: #2d9574;">"($1 * $2) % $3"</span> nil result base modulus<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">setf</span> exponent <span style="color: #b1951d;">(</span>calc-eval <span style="color: #2d9574;">"$1 \\ 2"</span> nil exponent<span style="color: #b1951d;">)</span>
            base <span style="color: #b1951d;">(</span>calc-eval <span style="color: #2d9574;">"($1 * $1) % $2"</span> nil base modulus<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    result<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
校验签名的过程跟上面是一样的,只不过使用公钥e参与运算: <code>m ≡ s^e (mod n)</code>. 
如果签名是正确的,那么m会被正确地还原. 
理论上讲,只有在直到 <code>d</code> 的情况下才能从 <code>m</code> 计算出 <code>s</code> 来.
不过,如果 <code>n</code> 的值 <a href="http://crypto.stackexchange.com/a/5942">太小了</a>, 很容易就能分解出 <code>p</code> 和 <code>q</code> 来,那么 <code>d</code> 也就很容易从公钥中推算出来. 
所以,一定要注意你选择的 <code>p</code> 和 <code>q</code> 有足够的强度.
</p>

<p>
现在还剩下一个问题: 一般用户都是对字符串或者文件这类东西作签名的,不太可能对一个整数去做签名.
所幸,通过hash函数可以将任意长度的数据转换成一段适合签名的整数. 
Emacs本身就自带了很多hash算法,可以通过 <code>secure-hash</code> 函数来调用. 它可以对字符串和buffer进行hash运算.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>secure-hash 'sha224 <span style="color: #2d9574;">"Hello, world!"</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; "8552d8b7a7dc5476cb9e25dee69a8091290764b7f2a64fe6e78e9568"</span>
</pre>
</div>

<p>
由于结果是一个十六进制数,所以只要在签名加上 <code>16#</code> 就能直接当成calc中的整型来用了.
</p>

<p>
下面是实现的签名和验签函数,可以用来对字符串或buffer进行签名.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">rsa-sign</span> <span style="color: #bc6ec5;">(</span>private-key object<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>n <span style="color: #b1951d;">(</span>plist-get private-key <span style="color: #4f97d7;">:n</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
        <span style="color: #67b11d;">(</span>d <span style="color: #b1951d;">(</span>plist-get private-key <span style="color: #4f97d7;">:d</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
        <span style="color: #67b11d;">(</span>hash <span style="color: #b1951d;">(</span>concat <span style="color: #2d9574;">"16#"</span> <span style="color: #4f97d7;">(</span>secure-hash 'sha384 object<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">truncate hash such that hash &lt; n</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #67b11d;">(</span>calc-eval <span style="color: #2d9574;">"$1 &gt; $2"</span> 'pred hash n<span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">setf</span> hash <span style="color: #b1951d;">(</span>calc-eval <span style="color: #2d9574;">"$1 \\ 2"</span> nil hash<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span>rsa--mod-pow hash d n<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">rsa-verify</span> <span style="color: #bc6ec5;">(</span>public-key object sig<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>n <span style="color: #b1951d;">(</span>plist-get public-key <span style="color: #4f97d7;">:n</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
        <span style="color: #67b11d;">(</span>e <span style="color: #b1951d;">(</span>plist-get public-key <span style="color: #4f97d7;">:e</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
        <span style="color: #67b11d;">(</span>hash <span style="color: #b1951d;">(</span>concat <span style="color: #2d9574;">"16#"</span> <span style="color: #4f97d7;">(</span>secure-hash 'sha384 object<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">truncate hash such that hash &lt; n</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #67b11d;">(</span>calc-eval <span style="color: #2d9574;">"$1 &gt; $2"</span> 'pred hash n<span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">setf</span> hash <span style="color: #b1951d;">(</span>calc-eval <span style="color: #2d9574;">"$1 \\ 2"</span> nil hash<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">let*</span> <span style="color: #67b11d;">(</span><span style="color: #b1951d;">(</span>result <span style="color: #4f97d7;">(</span>rsa--mod-pow sig e n<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span>calc-eval <span style="color: #2d9574;">"$1 == $2"</span> 'pred result hash<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
注意到这里面包含了一个对hash结果进行阶段的步骤. 这一步实际上会让你的 <code>n</code> 变得很容易被分解!
我这里之所以有这么一个步骤是因为本来这也就是写来玩玩的,而且我也不希望太大的key造成运算速度太过缓慢.
</p>
</div>
</div>
